In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.924502  0.010479
1    a  two  1.113221  0.713978
2    b  one  0.041110 -0.230997
3    b  two  0.777901 -0.853038
4    a  one  0.648905  0.252732

In [2]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    1.228876
b    0.409505
Name: data1, dtype: float64

In [3]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means.unstack()

key2       one       two
key1
a     1.286703  1.113221
b     0.041110  0.777901

In [4]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

df['data1'].groupby([states, years]).mean()

California  2005    1.113221
            2006    0.041110
Ohio        2005    1.351201
            2006    0.648905
Name: data1, dtype: float64

In [5]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   1.286703  0.131606
     two   1.113221  0.713978
b    one   0.041110 -0.230997
     two   0.777901 -0.853038

In [6]:
for name, group in df.groupby(['key1']):
  print(name)
  print(group)

a
  key1 key2     data1     data2
0    a  one  1.924502  0.010479
1    a  two  1.113221  0.713978
4    a  one  0.648905  0.252732
b
  key1 key2     data1     data2
2    b  one  0.041110 -0.230997
3    b  two  0.777901 -0.853038

/tmp/ipykernel_269165/2911846924.py:1: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for name, group in df.groupby(['key1']):

In [7]:
df[['data2']].groupby(df['key1'])

In [8]:
df['data2'].groupby(df['key1'])

In [9]:
grouped = df.groupby(['key1', 'key2'])
grouped['data1'].agg('mean') # grouped['data1'].mean()

key1  key2
a     one     1.286703
      two     1.113221
b     one     0.041110
      two     0.777901
Name: data1, dtype: float64

In [10]:
grouped['data1'].agg(['mean', 'std'])

               mean       std
key1 key2
a    one   1.286703  0.901983
     two   1.113221       NaN
b    one   0.041110       NaN
     two   0.777901       NaN

In [11]:
grouped['data1'].agg([('foo', 'mean'), ('bar', np.std)]) # columns

                foo       bar
key1 key2
a    one   1.286703  0.901983
     two   1.113221       NaN
b    one   0.041110       NaN
     two   0.777901       NaN

In [12]:
grouped[['data1', 'data2']].agg(['count', 'mean', 'max'])

          data1                     data2
          count      mean       max count      mean       max
key1 key2
a    one      2  1.286703  1.924502     2  0.131606  0.252732
     two      1  1.113221  1.113221     1  0.713978  0.713978
b    one      1  0.041110  0.041110     1 -0.230997 -0.230997
     two      1  0.777901  0.777901     1 -0.853038 -0.853038

In [18]:
people = pd.DataFrame(np.random.randn(5, 5), 
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 
           'd': 'blue', 'e': 'red', 'f' : 'orange'}
print(people)
by_column = people.groupby(mapping, axis= 1)
by_column.sum()

               a         b         c         d         e
Joe     0.650677 -0.663471 -0.462453 -1.858310 -0.766964
Steve   1.520845  0.267871  0.350473 -0.581855 -0.973010
Wes     1.892102       NaN       NaN  1.112682  0.411405
Jim     1.325385  0.966907 -1.269947  0.229239 -1.115070
Travis -0.787684  1.155900  1.445724 -0.265923  0.770088

            blue       red
Joe    -2.320763 -0.779757
Steve  -0.231381  0.815706
Wes     1.112682  2.303507
Jim    -1.040708  1.177222
Travis  1.179801  1.138304

In [22]:
map_series = pd.Series(mapping)
print(map_series)
people.groupby(map_series, axis=1).count()

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [23]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                     names=['city', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

city         US                            JP
tenor         1         3         5         1         3
0     -1.857757  0.777550  0.525381 -1.071510  0.270670
1      0.078244 -3.805699  0.657597  0.591603  0.425895
2      1.245999 -0.900394  1.692414  0.804894 -0.509073
3      0.873341 -0.914368  0.708267  0.462188 -0.058695

In [41]:
hier_df.groupby(by=['city'], axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

In [42]:
frame = pd.DataFrame({'data1': np.random.randn(1000), 'data2': np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0     (0.0604, 1.639]
1     (0.0604, 1.639]
2    (-3.103, -1.518]
3    (-1.518, 0.0604]
4      (1.639, 3.217]
5     (0.0604, 1.639]
6    (-1.518, 0.0604]
7    (-1.518, 0.0604]
8    (-1.518, 0.0604]
9    (-1.518, 0.0604]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.103, -1.518] < (-1.518, 0.0604] < (0.0604, 1.639] < (1.639, 3.217]]

In [44]:
result = frame.data2.groupby(quartiles).apply(lambda x : {'min': x.min(), 'max': x.max(), 'count': x.count(), 'mean': x.mean()})
result.unstack()

                       min       max  count      mean
data1
(-3.103, -1.518] -2.112196  2.036950   63.0 -0.009021
(-1.518, 0.0604] -2.898288  3.469715  450.0 -0.039037
(0.0604, 1.639]  -2.903015  3.807426  439.0 -0.050192
(1.639, 3.217]   -2.339995  1.955608   48.0 -0.086832